src/result/wrk_async.txt
GET
Running 30s test @ http://localhost:8080
  4 threads and 4 connections
  Thread calibration: mean lat.: 1.751ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.733ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.771ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.742ms, rate sampling interval: 10ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.26ms  566.17us   3.50ms   64.47%
    Req/Sec     1.32k   120.73     1.78k    68.84%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    1.23ms
 75.000%    1.67ms
 90.000%    2.05ms
 99.000%    2.52ms
 99.900%    2.75ms
 99.990%    3.03ms
 99.999%    3.28ms
100.000%    3.50ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.146     0.000000            1         1.00
       0.500     0.100000        10006         1.11
       0.752     0.200000        20024         1.25
       0.924     0.300000        30033         1.43
       1.079     0.400000        40041         1.67
       1.228     0.500000        50002         2.00
       1.300     0.550000        55015         2.22
       1.377     0.600000        59989         2.50
       1.463     0.650000        65013         2.86
       1.559     0.700000        69973         3.33
       1.667     0.750000        74970         4.00
       1.726     0.775000        77501         4.44
       1.786     0.800000        80005         5.00
       1.845     0.825000        82493         5.71
       1.909     0.850000        84987         6.67
       1.976     0.875000        87471         8.00
       2.012     0.887500        88722         8.89
       2.051     0.900000        89991        10.00
       2.095     0.912500        91264        11.43
       2.139     0.925000        92469        13.33
       2.191     0.937500        93715        16.00
       2.219     0.943750        94359        17.78
       2.247     0.950000        95010        20.00
       2.273     0.956250        95611        22.86
       2.305     0.962500        96220        26.67
       2.343     0.968750        96866        32.00
       2.361     0.971875        97164        35.56
       2.381     0.975000        97476        40.00
       2.403     0.978125        97776        45.71
       2.429     0.981250        98107        53.33
       2.457     0.984375        98419        64.00
       2.471     0.985938        98561        71.11
       2.489     0.987500        98727        80.00
       2.503     0.989062        98870        91.43
       2.523     0.990625        99039       106.67
       2.543     0.992188        99189       128.00
       2.555     0.992969        99262       142.22
       2.569     0.993750        99338       160.00
       2.583     0.994531        99425       182.86
       2.599     0.995313        99496       213.33
       2.619     0.996094        99571       256.00
       2.631     0.996484        99610       284.44
       2.639     0.996875        99649       320.00
       2.651     0.997266        99689       365.71
       2.667     0.997656        99728       426.67
       2.691     0.998047        99766       512.00
       2.703     0.998242        99787       568.89
       2.715     0.998437        99807       640.00
       2.725     0.998633        99827       731.43
       2.737     0.998828        99848       853.33
       2.753     0.999023        99864      1024.00
       2.769     0.999121        99874      1137.78
       2.777     0.999219        99883      1280.00
       2.789     0.999316        99893      1462.86
       2.803     0.999414        99903      1706.67
       2.815     0.999512        99912      2048.00
       2.843     0.999561        99917      2275.56
       2.855     0.999609        99921      2560.00
       2.875     0.999658        99926      2925.71
       2.897     0.999707        99932      3413.33
       2.905     0.999756        99936      4096.00
       2.933     0.999780        99939      4551.11
       2.945     0.999805        99941      5120.00
       2.959     0.999829        99944      5851.43
       2.979     0.999854        99947      6826.67
       2.999     0.999878        99948      8192.00
       3.029     0.999890        99950      9102.22
       3.041     0.999902        99951     10240.00
       3.043     0.999915        99952     11702.86
       3.047     0.999927        99953     13653.33
       3.055     0.999939        99954     16384.00
       3.147     0.999945        99955     18204.44
       3.171     0.999951        99956     20480.00
       3.171     0.999957        99956     23405.71
       3.175     0.999963        99957     27306.67
       3.175     0.999969        99957     32768.00
       3.207     0.999973        99958     36408.89
       3.207     0.999976        99958     40960.00
       3.207     0.999979        99958     46811.43
       3.281     0.999982        99959     54613.33
       3.281     0.999985        99959     65536.00
       3.281     0.999986        99959     72817.78
       3.281     0.999988        99959     81920.00
       3.281     0.999989        99959     93622.86
       3.499     0.999991        99960    109226.67
       3.499     1.000000        99960          inf
#[Mean    =        1.260, StdDeviation   =        0.566]
#[Max     =        3.498, Total count    =        99960]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  149987 requests in 30.00s, 9.87MB read
  Non-2xx or 3xx responses: 149987
Requests/sec:   4999.68
Transfer/sec:    336.89KB

PUT
Running 30s test @ http://localhost:8080
  4 threads and 4 connections
  Thread calibration: mean lat.: 2.594ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 2.615ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 2.418ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.944ms, rate sampling interval: 10ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.78ms    4.04ms  70.53ms   97.47%
    Req/Sec     1.32k   246.39     4.30k    94.97%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    1.23ms
 75.000%    1.66ms
 90.000%    2.12ms
 99.000%   21.71ms
 99.900%   54.40ms
 99.990%   68.67ms
 99.999%   70.27ms
100.000%   70.59ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.117     0.000000            1         1.00
       0.511     0.100000        10019         1.11
       0.738     0.200000        20032         1.25
       0.924     0.300000        30018         1.43
       1.083     0.400000        40036         1.67
       1.232     0.500000        50005         2.00
       1.305     0.550000        54985         2.22
       1.382     0.600000        60005         2.50
       1.463     0.650000        64990         2.86
       1.556     0.700000        69999         3.33
       1.659     0.750000        75002         4.00
       1.714     0.775000        77511         4.44
       1.774     0.800000        80007         5.00
       1.838     0.825000        82492         5.71
       1.914     0.850000        84993         6.67
       2.002     0.875000        87478         8.00
       2.059     0.887500        88732         8.89
       2.115     0.900000        89977        10.00
       2.179     0.912500        91226        11.43
       2.259     0.925000        92487        13.33
       2.355     0.937500        93733        16.00
       2.413     0.943750        94352        17.78
       2.489     0.950000        94976        20.00
       2.597     0.956250        95599        22.86
       2.801     0.962500        96223        26.67
       3.571     0.968750        96847        32.00
       4.475     0.971875        97160        35.56
       5.983     0.975000        97472        40.00
       7.703     0.978125        97785        45.71
      10.095     0.981250        98098        53.33
      13.055     0.984375        98409        64.00
      14.767     0.985938        98566        71.11
      17.103     0.987500        98723        80.00
      19.615     0.989062        98878        91.43
      23.423     0.990625        99035       106.67
      27.407     0.992188        99190       128.00
      29.247     0.992969        99270       142.22
      30.991     0.993750        99347       160.00
      33.375     0.994531        99427       182.86
      36.127     0.995313        99503       213.33
      38.399     0.996094        99581       256.00
      39.263     0.996484        99620       284.44
      40.735     0.996875        99659       320.00
      43.007     0.997266        99698       365.71
      44.895     0.997656        99737       426.67
      46.943     0.998047        99776       512.00
      48.095     0.998242        99796       568.89
      49.279     0.998437        99815       640.00
      50.655     0.998633        99835       731.43
      52.799     0.998828        99854       853.33
      54.751     0.999023        99874      1024.00
      55.743     0.999121        99884      1137.78
      56.351     0.999219        99893      1280.00
      57.343     0.999316        99903      1462.86
      58.399     0.999414        99913      1706.67
      59.711     0.999512        99923      2048.00
      60.703     0.999561        99928      2275.56
      61.951     0.999609        99932      2560.00
      63.583     0.999658        99937      2925.71
      64.799     0.999707        99942      3413.33
      66.239     0.999756        99947      4096.00
      67.007     0.999780        99950      4551.11
      67.135     0.999805        99952      5120.00
      67.519     0.999829        99954      5851.43
      67.967     0.999854        99957      6826.67
      68.095     0.999878        99959      8192.00
      68.671     0.999890        99962      9102.22
      68.671     0.999902        99962     10240.00
      69.055     0.999915        99964     11702.86
      69.055     0.999927        99964     13653.33
      69.183     0.999939        99966     16384.00
      69.183     0.999945        99966     18204.44
      69.311     0.999951        99967     20480.00
      69.311     0.999957        99967     23405.71
      69.375     0.999963        99968     27306.67
      69.375     0.999969        99968     32768.00
      69.759     0.999973        99969     36408.89
      69.759     0.999976        99969     40960.00
      69.759     0.999979        99969     46811.43
      70.271     0.999982        99970     54613.33
      70.271     0.999985        99970     65536.00
      70.271     0.999986        99970     72817.78
      70.271     0.999988        99970     81920.00
      70.271     0.999989        99970     93622.86
      70.591     0.999991        99971    109226.67
      70.591     1.000000        99971          inf
#[Mean    =        1.782, StdDeviation   =        4.040]
#[Max     =       70.528, Total count    =        99971]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  149995 requests in 30.00s, 9.58MB read
Requests/sec:   4999.75
Transfer/sec:    327.13KB

STATUS
Running 10s test @ http://localhost:8080/v0/status
  2 threads and 10 connections
 Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   168.07us   80.84us   4.57ms   95.38%
    Req/Sec    27.71k     1.85k   30.55k    83.17%
  Latency Distribution
     50%  164.00us
     75%  175.00us
     90%  190.00us
     99%  379.00us
  556800 requests in 10.10s, 55.76MB read
Requests/sec:  55133.88
Transfer/sec:      5.52MB

Пропускная способность увеличилась (после перехода от блокирующей к асинхронной реализации):
- почти в 25 раз у метода GET
- немного у метода PUT
- в 3 раза STATUS

Из профилирования видно, что задачи работы с сокетом и задачи работы с хранилищем разделены. Запросы к /status работают быстрее и не ждут пока выполнятся другие запросы, связанные с хранилищем